---
kind: property
id: P:Autodesk.Revit.DB.Visual.AdvancedWood.WoodEarlycolorPerlinEnable
source: html/cd67ead0-78cb-ef5e-29f2-3af650952195.htm
---
# Autodesk.Revit.DB.Visual.AdvancedWood.WoodEarlycolorPerlinEnable Property

The property labeled "Use perlin noise for earlywood color" from the "AdvancedWood" schema.

## Syntax (C#)
```csharp
public static string WoodEarlycolorPerlinEnable { get; }
```

## Remarks
This property is of type "AssetPropertyBoolean".